# PipeInsulationThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipeInsulationThickness Property
SpecTypeId Class See Also
---
Pipe Insulation Thickness, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipeInsulationThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipeInsulationThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipeInsulationThickness {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace